In [18]:
#groupby()메서드 사용 
from pandas import Series, DataFrame
import numpy as np 

df = DataFrame({'key1':['a','a','b','b','a'], 
                'key2':['one','two','one','two','one'], 
                'data1':np.random.randn(5), 
                'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.224317  0.916490
1    a  two  2.016634 -1.823130
2    b  one  0.362637  0.126347
3    b  two  1.054548  1.458846
4    a  one  0.395309 -0.082284

In [37]:
grouped = df.groupby("key2")["data1"]
grouped.sum()

key2
one   -0.466370
two    3.071182
Name: data1, dtype: float64

In [20]:
print( grouped.mean() )
print( grouped.sum() )
print( grouped.count() )

key1
a    0.395875
b    0.708593
Name: data1, dtype: float64
key1
a    1.187626
b    1.417186
Name: data1, dtype: float64
key1
a    3
b    2
Name: data1, dtype: int64

In [39]:
#복합키를 사용하는 경우(컬럼의 순서를 지정)
#메서드체인(함수체인)
means = df.groupby( ["key2","key1"] )["data2"].count()
means

key2  key1
one   a       2
      b       1
two   a       1
      b       1
Name: data2, dtype: int64

In [40]:
#학급 성적 
dfClass = DataFrame({"학급":[1,1,2,2,1], 
                     "이름":["홍길동","전우치","이순신","박문수","김길동"],
                     "국어":[100,90,95,100,80], 
                     "영어":[80,90,95,92,89], 
                     "수학":[90,80,92,100,80]
                     })

dfClass

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
1   1  전우치   90  90   80
2   2  이순신   95  95   92
3   2  박문수  100  92  100
4   1  김길동   80  89   80

In [41]:
#합계
sum(dfClass["국어"])

465

In [42]:
#평균
sum(dfClass["국어"])/5

93.0

In [45]:
#오름차순
dfClass.sort_values("이름")

   학급   이름   국어  영어   수학
4   1  김길동   80  89   80
3   2  박문수  100  92  100
2   2  이순신   95  95   92
1   1  전우치   90  90   80
0   1  홍길동  100  80   90

In [46]:
#내림차순
dfClass.sort_values("영어", ascending=False)

   학급   이름   국어  영어   수학
2   2  이순신   95  95   92
3   2  박문수  100  92  100
1   1  전우치   90  90   80
4   1  김길동   80  89   80
0   1  홍길동  100  80   90

In [47]:
#새로운 컬럼 추가하기
dfClass["전체"] = dfClass["국어"] + dfClass["수학"] + dfClass["영어"]

In [48]:
#평균을 추가하기 
dfClass["평균"] = (dfClass["국어"] + dfClass["수학"] + dfClass["영어"])/3

In [29]:
dfClass

   학급   이름   국어  영어   수학   전체         평균
0   1  홍길동  100  80   90  270  90.000000
1   1  전우치   90  90   80  260  86.666667
2   2  이순신   95  95   92  282  94.000000
3   2  박문수  100  92  100  292  97.333333
4   1  김길동   80  89   80  249  83.000000

In [30]:
#내림차순 정렬하기 
dfClass.sort_values("평균", ascending=False)

   학급   이름   국어  영어   수학   전체         평균
3   2  박문수  100  92  100  292  97.333333
2   2  이순신   95  95   92  282  94.000000
0   1  홍길동  100  80   90  270  90.000000
1   1  전우치   90  90   80  260  86.666667
4   1  김길동   80  89   80  249  83.000000

In [31]:
#학급별로 그룹핑하기 
dfClass.groupby("학급")["국어"].mean()

학급
1    90.0
2    97.5
Name: 국어, dtype: float64

In [32]:
dfClass.agg(수학평균=("수학","mean"))

        수학
수학평균  88.4

In [33]:
dfClass.groupby("학급").agg(수학평균=("수학","mean"))

         수학평균
학급
1   83.333333
2   96.000000

In [49]:
dfClass.groupby("학급").agg(국어평균=("국어","sum"), 
            수학평균=("수학","sum"),
            영어평균=("영어","sum"), 
            갯수=("학급","count"))

    국어평균  수학평균  영어평균  갯수
학급
1    270   250   259   3
2    195   192   187   2